Revit 2024 API
PanelScheduleView.IsSpace Method
 Check if the selected cell is a space
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsSpace(
	int nRow,
	int nCol
)
Visual Basic
Public Function IsSpace ( _
	nRow As Integer, _
	nCol As Integer _
) As Boolean
Visual C++
public:
bool IsSpace(
	int nRow,
	int nCol
)
Parameters
nRow
Type: System.Int32
 Row Number
nCol
Type: System.Int32
 Column Number
Return Value
 True if the selected cell is a space, false otherwise
See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace